JayHeng/RT-MFB/boards/mimxrt/mfb_fw/src/mfb.c
#if MICRON_DEVICE_SERIES
            // Micron
            case 0x20:
                {
                    mfb_printf(" -- Micron Serial Flash.\r\n");
                    mfb_printf("MFB: Flash Memory Type ID: 0x%x", memoryTypeID);
                    switch (memoryTypeID)
                    {
                        case 0xBA:
                            mfb_printf(" -- MT25QL QuadSPI 3.3V Series.\r\n");
                            break;
                        case 0xBB:
                            mfb_printf(" -- MT25QU QuadSPI 1.8V Series.\r\n");
                            break;
                        case 0x5A:
                            isOctalFlash = true;
                            mfb_printf(" -- MT35XL OctalSPI 3.3V Series.\r\n");
                            break;
                        case 0x5B:
                            isOctalFlash = true;
                            mfb_printf(" -- MT35XU OctalSPI 1.8V Series.\r\n");
                            break;
                        default:
                            mfb_printf(" -- Unsupported Series.\r\n");
                            break;
                    }
                    mfb_show_mem_size(capacityID, false);
#if MICRON_DEVICE_MT25QL256
                    if (!isOctalFlash)
                    {
                        flexspi_pin_init(EXAMPLE_FLEXSPI, FLASH_PORT, kFLEXSPI_4PAD);
                        flexspi_clock_init(EXAMPLE_FLEXSPI, kFlexspiRootClkFreq_100MHz);
                        /* Update root clock */
                        deviceconfig.flexspiRootClk = flexspi_get_clock(EXAMPLE_FLEXSPI);
                        deviceconfig.flashSize = flashMemSizeInByte / 0x400;
                        s_flashBusyStatusPol    = MICRON_FLASH_BUSY_STATUS_POL;
                        s_flashBusyStatusOffset = MICRON_FLASH_BUSY_STATUS_OFFSET;
                        /* Re-init FlexSPI using custom LUT */
                        flexspi_nor_flash_init(EXAMPLE_FLEXSPI, customLUT_MICRON_Quad, kFLEXSPI_ReadSampleClkLoopbackFromDqsPad);
                        /* No need to enable quad mode for micron device. */
                    }
#endif
#if MICRON_DEVICE_MT35XU512
                    if (isOctalFlash)
                    {
                        flexspi_root_clk_freq_t rootClkFreq = kFlexspiRootClkFreq_200MHz;
                        flexspi_pin_init(EXAMPLE_FLEXSPI, FLASH_PORT, kFLEXSPI_8PAD);
                        flexspi_clock_init(EXAMPLE_FLEXSPI, rootClkFreq);
                        /* Update root clock */
                        deviceconfig.flexspiRootClk = flexspi_get_clock(EXAMPLE_FLEXSPI);
                        deviceconfig.flashSize = flashMemSizeInByte / 0x400;
                        s_flashBusyStatusPol    = MICRON_FLASH_BUSY_STATUS_POL;
                        s_flashBusyStatusOffset = MICRON_FLASH_BUSY_STATUS_OFFSET;
                        s_flashEnableOctalCmd   = MICRON_OCTAL_FLASH_ENABLE_DDR_CMD;
                        /* Re-init FlexSPI using custom LUT */
                        flexspi_nor_flash_init(EXAMPLE_FLEXSPI, customLUT_MICRON_Octal, kFLEXSPI_ReadSampleClkExternalInputFromDqsPad);
                        // Set dummy cycle of Flash
                        if (rootClkFreq == kFlexspiRootClkFreq_200MHz)
                        {
                            dummyValue = MICRON_OCTAL_FLASH_SET_DUMMY_CMD;
                            flexspi_nor_set_dummy_cycle(EXAMPLE_FLEXSPI, MICRON_OCTAL_FLASH_SET_DUMMY_CMD);
                        }
                        /* Enter octal mode. */
                        status = flexspi_nor_enable_octal_mode(EXAMPLE_FLEXSPI);
                    }
#endif
                    break;
                }
#endif // MICRON_DEVICE_SERIES

#if GIGADEVICE_DEVICE_SERIE
            // GigaDevice
            case 0xc8:
                {
                    mfb_printf(" -- GigaDevice Serial Flash.\r\n");
                    mfb_printf("MFB: Flash Memory Type ID: 0x%x", memoryTypeID);
                    switch (memoryTypeID)
                    {
                        case 0x40:
                            // GD25D DualSPI
                            mfb_printf(" -- GD25Q/GD25B/GD25S QuadSPI 3.3V Series.\r\n");
                            break;
                        case 0x42:
                            mfb_printf(" -- GD25VQ/GD25VE QuadSPI 2.5V Series.\r\n");
                            break;
                        case 0x47:
                            mfb_printf(" -- GD55B QuadSPI 3.3V Series.\r\n");
                            break;
                        case 0x60:
                            // GD25LD DualSPI
                            mfb_printf(" -- GD25LE/GD25LQ QuadSPI 1.8V Series.\r\n");
                            break;
                        case 0x63:
                            mfb_printf(" -- GD25LF/GD55LF QuadSPI 1.8V Series.\r\n");
                            break;
                        case 0x65:
                            // GD25WD DualSPI
                            mfb_printf(" -- GD25W/GD55W QuadSPI 1.8-3.3V Series.\r\n");
                            break;
                        case 0x66:
                            mfb_printf(" -- GD25LT/GD55LT QuadSPI 1.8V Series.\r\n");
                            break;
                        case 0x67:
                            mfb_printf(" -- GD25LB/GD55LB QuadSPI 1.8V Series.\r\n");
                            break;
                        case 0x68:
                            mfb_printf(" -- GD25LX/GD55LX OctalSPI 1.8V Series.\r\n");
                            break;
                        // Missing GD25F, GD25LR, GD25T, GD25R
                        // Missing GD25X,
                        default:
                            mfb_printf(" -- Unsupported Series.\r\n");
                            break;
                    }
                    mfb_show_mem_size(capacityID, false);
#if GIGADEVICE_DEVICE_GD25Q64C

#endif
                    break;
                }
#endif // GIGADEVICE_DEVICE_SERIE

#if ADESTO_DEVICE_SERIE
            // Adesto
            case 0x1f:
                {
                    mfb_printf(" -- Adesto Serial Flash.\r\n");
                    if (memoryTypeID != 0x42)
                    {
                        capacityID = memoryTypeID & 0x1F;
                        memoryTypeID = (memoryTypeID & 0xE0) >> 5;
                        mfb_printf("MFB: Flash Family Code: 0x%x", memoryTypeID);
                    }
                    else
                    {
                        mfb_printf("MFB: Flash Memory Type ID: 0x%x", memoryTypeID);
                    }
                    switch (memoryTypeID)
                    {
                        case 0x00:
                            mfb_printf(" -- AT25EU QuadSPI 1.8-3.3V Series.\r\n");
                            break;
                        case 0x01:
                            mfb_printf(" -- AT25DQ QuadSPI 2.5V Series.\r\n");
                            break;
                        case 0x02:
                            mfb_printf(" -- AT25FF/AT25XE/AT25XV QuadSPI 1.8-3.3V Series.\r\n");
                            break;
                        case 0x04:
                            mfb_printf(" -- AT25SF/AT25QF QuadSPI 3.3V Series.\r\n");
                            break;
                        // Only this type is same as other vendors
                        case 0x42:
                            mfb_printf(" -- AT25SL/AT25QL QuadSPI 1.8V Series.\r\n");
                            break;
                        default:
                            mfb_printf(" -- Unsupported Series.\r\n");
                            break;
                    }
                    if (memoryTypeID != 0x42)
                    {
                        mfb_show_mem_size(capacityID, true);
                        flashMemSizeInByte = mfb_decode_adesto_capacity_id(capacityID);
                    }
                    else
                    {
                        mfb_show_mem_size(capacityID, false);
                        flashMemSizeInByte = mfb_decode_common_capacity_id(capacityID);
                    }
#if ADESTO_DEVICE_AT25SF128A
                    if (!isOctalFlash)
                    {
                        flexspi_pin_init(EXAMPLE_FLEXSPI, FLASH_PORT, kFLEXSPI_4PAD);
                        flexspi_clock_init(EXAMPLE_FLEXSPI, kFlexspiRootClkFreq_133MHz);
                        /* Update root clock */
                        deviceconfig.flexspiRootClk = flexspi_get_clock(EXAMPLE_FLEXSPI);
                        deviceconfig.flashSize = flashMemSizeInByte / 0x400;
                        s_flashBusyStatusPol    = ADESTO_FLASH_BUSY_STATUS_POL;
                        s_flashBusyStatusOffset = ADESTO_FLASH_BUSY_STATUS_OFFSET;
                        s_flashQuadEnableCfg    = ADESTO_FLASH_QUAD_ENABLE;
                        /* Re-init FlexSPI using custom LUT */
                        flexspi_nor_flash_init(EXAMPLE_FLEXSPI, customLUT_ADESTO_Quad, kFLEXSPI_ReadSampleClkLoopbackFromDqsPad);
                        /* Enter quad mode. */
                        status = flexspi_nor_enable_quad_mode(EXAMPLE_FLEXSPI);
                    }
#endif
                    break;
                }
#endif // ADESTO_DEVICE_SERIE

            default:
                mfb_printf("\r\nMFB: Unsupported Manufacturer ID\r\n");
                isValidVendorId = false;
                break;
        }
        if (isValidVendorId)
        {
            mfb_printf("\r\nMFB: FLEXSPI module is initialized to multi-I/O fast read mode.\r\n");
            flexspi_show_clock_source(EXAMPLE_FLEXSPI);
            if (status != kStatus_Success)
            {
                if (isOctalFlash)
                {
                    mfb_printf("MFB: Flash failed to Enter Octal I/O DDR mode.\r\n");
                }
                else
                {
                    mfb_printf("MFB: Flash failed to Enter Quad I/O SDR mode.\r\n");
                }
            }
            else
            {
                if (dummyValue)
                {
                    mfb_printf("MFB: Flash dummy cycle is set to %d.\r\n", dummyValue);
                }
                if (isOctalFlash)
                {
                    mfb_printf("MFB: Flash entered Octal I/O DDR mode.\r\n");
                }
                else
                {
                    mfb_printf("MFB: Flash entered Quad I/O SDR mode.\r\n");
                }
                mfb_flash_speed_test();
                microseconds_shutdown();
                mfb_jump_to_application(EXAMPLE_FLEXSPI_AMBA_BASE + MFB_APP_IMAGE_OFFSET);
            }
        }
    }
    mfb_printf("-------------------------------------\r\n");
}
